Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.GetLengthUnitTypeId
Gets the identifier of the length unit quantifying the reinforcement rounding values.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.IsActiveOnElement
Defines whether reinforcement rounding is activated for the particular element.
Remarks:
If these overrides relate to ReinforcementSettings, this property is shared for Rebar and Fabric related elements. Toggling this value will toggle the settings for both kinds of Reinforcement elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Reinforcement rounding overrides for this element cannot be enabled because overrides are not enabled for ReinforcementSettings.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.Element
The owner of the reinforcement rounding overrides.
Since:
2014